layer {
  type: 'Python'
  name: 'Argumentation'
  top: "data"
  top: "coverage-label"
  top: "bbox-label"
  top: "size-block"
  top: "obj-block"
  top: "coverage-block"
  python_param {
    module: 'data_argumentation_layer'
    layer: 'DataArgumentationLayer'
    param_str : "448,448,16,20,1,/home/krishneel/Documents/datasets/VOCdevkit/VOC2007/train.txt"
  }
  include: { 
    phase: TRAIN 
  }
}

layer {
  name: "upsample"
  type: "Deconvolution"
  bottom: "data" 
  top: "upsample"
  convolution_param {
      kernel_size: 5  ##! 2 * factor - factor % 2  >> factor is how big
      stride: 3  ##! factor
      num_output: 3 
      group: 3 
      pad: 1  ## int(ceil((factor - 1) / 2.))
      weight_filler: { 
          type: "bilinear" 
      } 
      bias_term: false
  }
  param { 
    lr_mult: 0.0
    decay_mult: 0.0
  }
}

layer {
  type: 'Python'
  name: 'Argumentation'
  bottom: "upsample"
  python_param {
    module: 'data_argumentation_layer'
    layer: 'DataArgumentationTestLayer'
  }
  include: { 
    phase: TRAIN 
  }
}

layer {
  name: "silent"
  type: "Silence"
  bottom: "coverage-label"
  bottom: "bbox-label"
  bottom: "size-block"
  bottom: "obj-block"
  bottom: "coverage-block"
  bottom: "upsample"
}